[
    {
        "productname":"Monitor LED AOC Gaming 27G2U5/BK 27 inch 1 ms Black FreeSync 75 Hz",
        "price":"190.00",
        "imagesource":"https://5.grgs.ro/images/products/1/370411/1986138/normal/gaming-27g2u5-bk-27-inch-1-ms-negru-freesync-75-hz-91b56b476eb3152a2525fbc31066eead.jpg",
        "itemURL" : "MONITOR-LED-AOC-Gaming-27G2U5-BK-27",
        "about" : "27 Inches VA LED Monitor 1920 x 1080\nDisplay size: 27.0 inches\nFreeSync\nHeight Adjust\n75Hz completely unleashes top end GPU's bringing unprecedented fluidity to the picture on your screen. Digital signal frequency: 30 -255kHz (H) 48 -240 Hz (V)\nCurved design wraps around you putting you at the center of the action and provides an immersive gaming experience.\nA pixel response time of 0.5 ms means speed without the smear for an enhanced experience. Fast-moving action and dramatic transitions will be rendered smoothly without the effects of ghosting."
    },
    {
        "productname":"Monitor LED Lenovo Gaming Legion Y25-25 24.5 inch 1ms FreeSync & G-Sync Compatible 240Hz",
        "price":"240.00",
        "imagesource":"https://5.grgs.ro/images/products/1/4917/2066602/full/gaming-legion-y25-25-245-inch-1ms-freesync-240hz-c2e8e18b6392852cdd77a3c376f020e8.jpg",
        "itemURL" : "MONITOR-LED-Lenovo-Gaming-Legion-Y25-25",
        "about" : "Made for high-paced, competitive eSports gaming, enjoy exceptionally smooth, stutter-free play with AMD FreeSync Premium, a 240Hz refresh rate, and 1ms response time\nThis 24.5 IPS FHD gaming monitor offers 3-side NearEdgeless bezels, 1920x1080 resolution, 178° viewing angle, and 99% sRGB\nHDMI 2.0 and DP 1.2 video connectivity; four built-in USB 3.2 ports also let you access data from external sources\nPlay in comfort – the stand for the Legion Y25-25 computer monitor offers multiple positions to tilt, pivot, swivel, or lift your screen, plus it's VESA mountable. There's even a hook for your headphones\nThis gaming monitor is also TÜV Rheinland Eye Comfort-certified, meaning your eyes are protected from harmful blue light, flickering screens, glare, and external reflections"
    },
    {
        "productname":"Monitor LED Alienware Gaming AW2720HFA 27 inch 1 ms Black FreeSync 240Hz",
        "price":"320.00",
        "imagesource":"https://5.grgs.ro/images/products/1/1977958/1986086/normal/gaming-aw2720hfa-27-inch-1-ms-black-freesync-240hz-5330e0737d0da9b120ead8efad4099c8.jpg",
        "itemURL" : "MONITOR-LED-Alienware-Gaming",
        "about" : "Rapid-fire: Experience the best available in IPS Technology with native refresh rates of up to 240Hz, which are 10x faster than movies and up to 2x faster than common 120Hz gaming monitors.\n1ms response. No gimmicks: A true 1ms response time with Overdrive blasts away blurs and provides fast, responsive gameplay.\nAMD FreeSync technology synchronizes the graphics card and the monitor, so you get epic, full-frame images that don’t slow down your gameplay. The Alienware 27 Gaming Monitor is also certified NVIDIA G-SYNC Compatible.\nTrue colors: With up to 99% sRGB color coverage, you have a wide array of colors in your arsenal.\nThe 27 screen allows you to effortlessly see the whole battlefield and all its details, while the native FHD resolution ensures games running in 1080p stay sharp and fast."
    },
    {
        "productname":"Monitor LED Alienware Gaming AW2721D 27 inch 1 ms Negru HDR G-Sync Ultimate 240 Hz",
        "price":"630.00",
        "imagesource":"https://4.grgs.ro/images/products/1/9395/2136942/full/gaming-aw2721d-27-inch-1-ms-negru-g-sync-ultimate-240-hz-f19e3be2c60468f41e578dbd1eb9120a.jpg",
        "itemURL" : "MONITOR-LED-ALienware-Gaming-AW2721D",
        "about" : "Triumph at Top Speed: Eliminate motion blur and smooth gameplay with a 240Hz high refresh rate and 1ms GTG response time.\nRevel in Vivid Colour: With 98% DCI-P3 colour coverage, every gaming experience features vibrant colours and incredible depth.\nImmerse Yourself in Victory: Dominate with lifelike images, improved contrast ratio, greater colour depth and remarkable clarity all thanks to VESA DisplayHDR 600.\nConquer in Full Comfort: Customise your comfort and game longer with the fully adjustable stand with height markers."
    },
    {
        "productname":"Monitor LED ViewSonic Gaming XG2705-2K 27 inch 1 ms Black FreeSync 144 Hz",
        "price":"340.00",
        "imagesource":"https://2.grgs.ro/images/products/1/5113/2140510/full/gaming-xg2705-2k-27-inch-1-ms-negru-freesync-144-hz-ca6e0190bebc821e173dd72a3cbff5cd.jpg",
        "itemURL" : "MONITOR-LED-ViewSonic-Gaming-XG2705",
        "about" : "IMMERSIVE GAMING: 2K QHD (2560x1440p) resolution, ultra-fast 1ms response time, and amazing 144Hz refresh rate give you the edge in all your gaming quests.\nAMD FREESYNC PREMIUM: Smooth frame rates, effectively eliminating image tearing, stuttering and jerkiness for smooth gameplay.\nADVANCED ERGONOMICS: A fully adjustable ergonomic stand, flicker-free technology and blue light filter delivers the comfort you need for marathon gaming sessions."
    },
    {
        "productname":"Monitor LED Samsung Gaming Odyssey G5A LS27AG500NUXEN 27 inch 1 ms Black HDR",
        "price":"440.00",
        "imagesource":"https://4.grgs.ro/images/products/1/2001/2253250/full/gaming-odyssey-g5a-ls27ag500nuxen-27-inch-1-ms-negru-hdr-freesync-premium-g-sync-compatible-165-hz-5625907742602e70e158107765734d78.jpg",
        "itemURL" : "MONITOR-LED-Samsung-Gaming-Odyssey-G5A",
        "about" : "1000R Curved Gaming monitor – industry-leading screen curvature for immersive, wraparound gaming\nWQHD 2560x1440p resolution & HDR 10 – delivers a crystal-clear picture and shows hidden details\n165hz refresh rate & 1ms response time – for lightning fast transitions with no motion blur"
    },
    {
        "productname":"Monitor LED DELL UltraSharp U2520D 25 inch 8 ms Black 60 Hz",
        "price":"470.00",
        "imagesource":"https://3.grgs.ro/images/products/1/2003606/2005018/full/ultrasharp-u2520d-25-inch-8-ms-negru-60-hz-70a43ee1c6aaee02a3285cb42d7e4a41.jpg",
        "itemURL" : "MONITOR-LED-DELL-UltraSharp-U250D",
        "about" : "Exceptional color Get true color reproduction with a wide color coverage including 99% sRGB 99% Rec 709 and 95% DCI-P3 With approximately 25% larger color coverage than sRGB DCI-P3 is becoming a color standard when creating and viewing content\nVirtually borderless Work with an uninterrupted view across multiple monitors with InfinityEdge And with a Dell dual monitor set up you can increase your productivity by up to 21%. Pixel pitch: 0.216 mm\nFlexibility for all-day comfort With the ability to tilt swivel pivot and adjust the height of your monitor to fit your needs you can stay comfortable all day"
    },
   {
        "productname":"Monitor LED Lenovo Gaming Legion Y27GQ-25 27 inch 2K 1ms G-Sync 240Hz",
        "price":"580.00",
        "imagesource":"https://4.grgs.ro/images/products/1/6835/2029466/full/gaming-legion-y27gq-20-27-inch-2k-1ms-g-sync-165hz-8379fe369323e2818e5fe2cd414d841a.jpg",
        "itemURL" : "MONITOR-LED-Lenovo-Legion-Y276Q25",
        "about" : "240Hz refresh rate and 0.5ms response time and the latest NVIDIA G-SYNC technology for ultra-fast and extremely smooth gaming\n40Hz refresh rate and 0.5ms response time and the latest NVIDIA G-SYNC technology for ultra-fast and extremely smooth gaming\nErgonomic lift, tilt, pivot and swivel functionality to easily adjust the monitor to suit your ideal posture"
    }
]
