[
    {
        "productname":"Smartphone Nokia X10, 5G Edition, 128GB, 4GB RAM, Dual SIM, 5G",
        "price":"350.00",
        "imagesource":"https://5.grgs.ro/images/products/1/7169/2230506/normal/x10-octa-core-128gb-4gb-ram-dual-sim-5g-5-camere-forrest-3-ani-garantie-b118a7ba630592417db3e90daf4687ae.jpg",
        "itemURL" : "SMARTPHONE-Nokia-X10-5G-Edition-128GB",
        "about" : "Work on the go with a Full HD+ screen\nBlazing connections with 5G\n48MP camera with ZEISS optics\nUp to 2-day battery life\n3 years of Android software updates\nEverything you need to power your business"
    },
    {
        "productname":"Smartphone Motorola Moto E7, Octa Core, 32GB, 2GB RAM, Dual SIM, 4G",
        "price":"150.00",
        "imagesource":"https://5.grgs.ro/images/products/1/4167/2179058/normal/moto-e7-octa-core-32gb-2gb-ram-dual-sim-4g-tri-camera-satin-coral-5766277b9d17685a59d4600a666851c7.jpg",
        "itemURL" : "SMARTPHONE-Motorola-Moto-E7-OctaCore-32GB",
        "about" : "48 mp camera system. capture sharper, brighter photos even at night and explore the smallest of details by getting incredibly close-up.\n6.5 max vision hd+ display. get carried away playing games, watching movies, and chatting with friends on an ultra-wide screen.\n36-hour battery. keep the fun going all day and into the night with a 4000 mah battery.\nocta-core performance. feel your phone respond instantly to every touch, tap, and swipe.\nfingerprint reader. securely unlock your phone with just the touch of your finger.\nDisplay size: 6.5 inches\nIncluded components: Charger"
    },
    {
        "productname":"Smartphone Realme 8, Super AMOLED, Gorilla Glass, 64GB, 4GB RAM, Dual SIM, 4G",
        "price":"250.00",
        "imagesource":"https://1.grgs.ro/images/products/1/9663/2220662/full/8-super-amoled-gorilla-glass-64gb-4gb-ram-dual-sim-4g-5-camere-baterie-5000-mah-3-card-slot-30w-dart-charge-punk-black-855f4f9443186099f595a85d6f3c43e8.jpg",
        "itemURL" : "SMARTPHONE-Realme-8-Super-AMOLED-Gorla-Class-64GB",
        "about": "5G. Go 700% Faster to a New World: The 5G era has arrived. With 700% faster speeds than 4G networks, 5G will turn your world upside down. realme 8 5G supports the latest 5G Dual-SIM Dual-Standby technology and is compatible with SA/NSA standards and mainstream bands worldwide\nSmart 5G. Smart Power Saving: As 5G consumes more power than the traditional 4G, it may shorten the phone's battery life. Introducing the Smart 5G technology on realme 8 5G - the phone intelligently switches between 4G and 5G depending on the usage scenario to save battery!\n5000mAh Massive Battery & 18W Quick Charge: By adopting the 5000mAh battery and 18W quick charge, the realme 8 5G gives you a super long entertainment time, helping you freely enjoy 5G intelligent life\n48MP Camera, see every detail. 16MP AI Beauty Selfie Always Stunning\nDynamic Light Design: To realize the racing design concept, we used a brilliant high-gloss indium plating process and lenticular pattern process to achieve a premium mirror effect to deliver a sense of light\n8.5mm Super Slim: 5G smartphones have 200% more antennas than 4G phones. We still created a slim experience for you - just 8.5mm thin and 185g light"
    },
    {
        "productname":"Samsung Galaxy S20 FE, Snapdragon Edition, Octa Core, 128GB, 6GB RAM, Dual SIM",
        "price":"600.00",
        "imagesource":"https://3.grgs.ro/images/products/1/7008/2090094/normal/galaxy-s20-fe-snapdragon-edition-octa-core-128gb-6gb-ram-dual-sim-5g-4-camere-cloud-navy-ecd9c1b9dd432df8747c3b9c59854d4b.jpg",
        "itemURL" : "SMARTPHONE-Samsung-Galaxy-S20-FR-120GB",
        "about" : "The Galaxy S20 FE is as bold on the inside as it is on the outside. With a 6.5 FHD+ Infinity-O Display, you can truly lose yourself in your latest binge-watch.\n12MP Ultra-wide lens, incredible zoom features like the 30x Space Zoom and the 3x Optical Zoom, along with our clear as day Night Mode.\nThe Galaxy S20 FE’s long-lasting, intelligent battery is built for those days that never seem to end. Plus, Super Fast Charging means you can power back up quickly.\nGet peace of mind with our defence-grade security - Samsung Knox, built into our Galaxy devices as standard. Working in the background to keep everything you love secure\nSmartphone preloaded with the Android V10 operating system"
    },
    {
        "productname":"Smartphone OnePlus Nord CE 5G, Octa Core, 128GB, 8GB RAM, Dual SIM, 5G, 4-Camere, Charcoal Ink",
        "price":"525.00",
        "imagesource":"https://1.grgs.ro/images/products/1/9033/2292374/normal/nord-ce-5g-ocata-core-128gb-8gb-ram-dual-sim-5g-4-camere-charcoal-ink-3ab2bc06294d93f09b0ebcd9f99a6b70.jpg",
        "itemURL" : "SMARTPHONE-OnePlus-Nord-CE-5G",
        "about" : "Shoot for Perfection with Nord CE's Triple Camera - 64MP Primary Lens with AI Scene detection and Nightscape Mode, 119° Ultra Wide Angle and 2MP Mono Lens.\nQualcomm Snapdragon 750G 5G Mobile platform - Performance driven AI powering incredible graphics and 5G Cloud Gaming.\nWarp Charge 30T Plus, 4500mAh Battery - Improved power transfer charges Nord CE's battery from 0 to 70% in just 30 minutes.\n90Hz AMOLED Display - Strikingly smooth, our 90 Hz refresh rate delivers 50% more visual information every second for a captivating experience.\nOxygenOS 11 - Pre installed with Google Communication Apps including Messages, Phone and Duo.\nAlexa Built-in phones let you make phone calls, open apps, control smart home devices, access the library of Alexa skills, and more using just your voice while on-the-go. Download the Alexa app and complete hands-free setup to get started. Just ask - and Alexa will respond instantly."
    },
    {
        "productname":"Smartphone Xiaomi 11 Lite NE, 5G Edition, AMOLED, 128GB, 8GB RAM, Dual SIM, 5G, 4-Camere, Peach Pink",
        "price":"440.00",
        "imagesource":"https://3.grgs.ro/images/products/1/5747/2288259/normal/11-lite-ne-5g-edition-octa-core-128gb-6gb-ram-dual-sim-5g-4-camere-peach-pink-d515d56cffc5dc2faf9ab26c1f96d7e3.jpg",
        "itemURL" : "SMARTPHONE-Xiaomi-11-Lite-NE-5G-Edition",
        "about" : "Qualcomm Snapdragon 778G and 33W fast charging. Be captivated by the blazing-fast performance made possible by the Qualcomm Snapdragon 778G 5G. Mobile Platform packed into Xiaomi 11 Lite 5G NE. This powerful 7-series chip comes with the 6th generation Qualcomm AI Engine, which delivers up to 12TOPS AI performance and supports Dual SIM Dual 5G.\nXiaomi 11 Lite 5G NE uses a 6.55 flat AMOLED display, and provides Dolby Vision support for a next-level visual experience. Featuring a full DCI-P3 wide color gamut, and a 10-bit TrueColor color depth, Xiaomi 11 Lite 5G NE provides an astonishing 1.07 billion onscreen colors for a high degree of color accuracy. To top things off, the screen also features a high refresh rate of 90Hz and a touch sampling rate of 240Hz, which keeps you entertained with significantly reduced lag and stuttering.\nThe ultra slim 6.81mm and ultra-lightweight 158g body of Xiaomi 11 Lite 5G NE delivers a clean and refreshing look that's just as eye-catching as it is comfortable to grip. Xiaomi's slimmest and lightest 5G smartphones, Xiaomi 11 Lite 5G NE is incredibly thin, measuring just 1.88mm and achieves an excellent balance between capabilities and form-factor.\nThis smartphone features a 64MP triple camera array, including a 64MP main, an 8MP Ultra-wide angle, and a SMP telemacro that enhances your purview, and can capture the world without limits. At night, Xiaomi 11 Lite SG NE's Night Mode captures clear shots using both the wide-angle camera and the front camera in Iow-light conditions.\nDespite its power, Xiaomi 11 Lite 5G NE is battery efficient. A large 4,250mAh battery that supports 33W fast charging keeps the phone powered throughout the day.\nAlexa Hands-free capable: Download the Alexa app on to use Alexa hands-free. Play music, make calls, hear news, open apps, navigate, and more, using just your voice, while on-the-go. Just ask and Alexa will respond instantly."
    },
    {
        "productname":"Smartphone Google Pixel 4a, OLED, HDR, 128GB, 6GB RAM, Single SIM, 4G, Just Black",
        "price":"559.00",
        "imagesource":"https://3.grgs.ro/images/products/1/7374/2166990/normal/pixel-4a-octa-core-128gb-6gb-ram-single-sim-4g-just-black-5d57c7995eb4a388e7abf8e71b8906fb.jpg",
        "itemURL" : "SMARTPHONE-Google-Pixel-4A-OLED",
        "about" : "Brilliant photos in any light. The Pixel 4a camera has the same features that Pixel is known for, like Live HDR+, dual exposure controls, Night Sight and Super Res Zoom.\nGoes from breakfast to bed. Pixel’s battery lasts up to 24 hours[1]. It adapts to the way you use your favourite apps and reduces power to the ones you rarely use. So you can swipe and stream to your heart’s content.\nA little help with your daily tasks. Let your Pixel help out with the small things, so you can do more of what you love. It has the new Google Assistant[2] to help you to control your phone, send texts and even search within apps[3]. It also has the exclusive Recorder app, which automatically transcribes speech and lets you search across your audio recordings[4].\nRest assured. Get peace of mind knowing that your phone is working to keep you and your things safe. Pixel 4a is protected by the Titan M security chip and receives guaranteed updates for at least three years[5]. It also has Google’s Personal Safety app. It helps you to reach the emergency services and can even detect if you’ve been in an accident [6]."
    },
    {
        "productname":"Smartphone OnePlus 8, AMOLED, Snapdragon 865, 256GB, 12GB RAM, Dual SIM, 5G, 4-Camera, Glacial Green, Oxygen OS",
        "price":"570.00",
        "imagesource":"https://3.grgs.ro/images/products/1/2045418/2047194/normal/8-ecran-90-hz-fluid-amoled-snapdragon-865-256gb-12gb-ram-dual-sim-5g-4-camera-glacial-green-oxygen-os-36e57e766d14de356852ba621b4825a1.jpg",
        "itemURL" : "SMARTPHONE-OnePlus-8-AMOLED-Snapdragon-865",
        "about" : "Autofocus : Multi Autofocus (PDAF+CAF).\nSmartphone OnePlus\nThe Fastest charging there is with 65W Warp Charge so you're ready for a full day in just 15 minutes\n4500 mAh Battery\nUltra Smooth 6.55 120Hz DisplayOnePlus 8T runs seamlessly with a 120Hz Fluid Display that makes Gaming, Swiping and Scrolling smooth like never before. Experience vibrant colours and stunning detail with a display optimised for HDR10+ content\nShoot like a pro with the 8T's Quad Camera system and 16MP Front Camera 48MP Primary rear sensor with optical image stabilisation (OIS) + 16MP Ultra wide angle, 5MP Macro, and 2MP Monochrome Lens."
    }
]